In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series(["blue", "yellow", "purple"], index=[1,2,3])
s

1      blue
2    yellow
3    purple
dtype: object

In [8]:
s.reindex(np.arange(6), method="ffill")

0       NaN
1      blue
2    yellow
3    purple
4    purple
5    purple
dtype: object

In [5]:
s

1      blue
2    yellow
3    purple
dtype: object

In [9]:
df = pd.DataFrame(np.arange(9).reshape(3,3),
                  index=["a", "c", "d"],
                  columns=["Tim", "Tom", "Kate"])
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [10]:
df.reindex(["d", "c", "a"])

   Tim  Tom  Kate
d    6    7     8
c    3    4     5
a    0    1     2

In [11]:
df.reindex(columns=["Kate","Tom","Tim"])

   Kate  Tom  Tim
a     2    1    0
c     5    4    3
d     8    7    6

In [12]:
df

   Tim  Tom  Kate
a    0    1     2
c    3    4     5
d    6    7     8

In [13]:
df.drop(["Tim"], axis=1)

   Tom  Kate
a    1     2
c    4     5
d    7     8

In [14]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index=["Kate","Tim","Tom","Alex"],
                    columns=list("ABCD"))
data

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [16]:
data.mean(axis="columns")

Kate     1.5
Tim      5.5
Tom      9.5
Alex    13.5
dtype: float64

In [17]:
data.drop("Alex")

      A  B   C   D
Kate  0  1   2   3
Tim   4  5   6   7
Tom   8  9  10  11

In [19]:
data.drop("A", axis=1)

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15